{"posts":[{"title":"Maze Generator - 迷宫生成器","text":"这个网站提供了多种不同类型的迷宫生成器，包括基于回溯算法和随机普里姆算法的迷宫生成器。用户可以选择不同的设置和算法，以生成符合自己需求的迷宫。网站的界面简洁明了，易于操作。同时，该网站还提供了对生成迷宫的一些控制，例如迷宫的大小、墙壁的厚度和颜色等等。总体来说，MazeGenerator.net 是一个优秀的迷宫生成器网站。 传送门：https://www.mazegenerator.net/ 使用方法： 打开 mazegenerator.net 网站，并选择您需要的迷宫类型，例如标准迷宫、圆形迷宫、三角形迷宫等等。可以在网页上方的下拉菜单中进行选择。 在迷宫设置区域中，您可以自定义迷宫的大小、难度等级、路径宽度、墙壁厚度等等。可以通过滑块或输入框进行设置。 在迷宫风格区域中，您可以选择迷宫的颜色和外观，例如背景颜色、墙壁颜色、路径颜色等等。 在网页的右侧区域，您可以预览生成的迷宫，并进行微调和修改。 点击 “Generate” 按钮，即可生成您所需要的迷宫。如果您不满意生成的迷宫，可以点击 “Generate New” 按钮进行重新生成。 生成的迷宫可以通过下载或复制链接的方式进行保存和分享。 示例：","link":"/2023/03/24/Maze-Generator/"},{"title":"JustLive - 直播平台整合","text":"该网站整合了哔哩哔哩、斗鱼、虎牙等几大直播平台。直播界面干净清爽，只保留了基础的直播+弹幕，没有了花里胡哨的页面，礼物，等级，粉丝牌等，享受最纯粹的直播体验！ 还可以跨平台关注各个主播，再也不需要在各个平台之间转来转去。目前的缺点就是无法发送弹幕，只能当个哑巴观众。 传送门：http://live.yj1211.work/index/home/recommend 详情： 关注 点进直播间再点击 关注 即可加入到你的JustLive关注列表，可以跨平台关注各大主播。 平台 随着其他直播平台的相继倒闭，目前主流的直播平台仅此几家。 分区 涵盖绝大多数类型的直播分区，。 电视 开发中 直播间 就tm一个字，清爽！ 点击关注按钮右边的链接跳转到原平台直播间。右侧是直播聊天功能，没有礼物、等级、花里胡哨的颜色，在这里人人平等。但是不能发送评论，只能看到评论。 点击画面内下方的按钮可以设置关闭或开启弹幕及弹幕样式等。 支持安卓APP下载。","link":"/2023/03/24/justlive/"}],"tags":[{"name":"益智","slug":"益智","link":"/tags/%E7%9B%8A%E6%99%BA/"},{"name":"迷宫","slug":"迷宫","link":"/tags/%E8%BF%B7%E5%AE%AB/"},{"name":"直播","slug":"直播","link":"/tags/%E7%9B%B4%E6%92%AD/"},{"name":"哔哩哔哩","slug":"哔哩哔哩","link":"/tags/%E5%93%94%E5%93%A9%E5%93%94%E5%93%A9/"},{"name":"斗鱼","slug":"斗鱼","link":"/tags/%E6%96%97%E9%B1%BC/"},{"name":"虎牙","slug":"虎牙","link":"/tags/%E8%99%8E%E7%89%99/"}],"categories":[{"name":"在线游戏","slug":"在线游戏","link":"/categories/%E5%9C%A8%E7%BA%BF%E6%B8%B8%E6%88%8F/"},{"name":"实用网站","slug":"实用网站","link":"/categories/%E5%AE%9E%E7%94%A8%E7%BD%91%E7%AB%99/"}],"pages":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new &quot;My New Post&quot; More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment","link":"/about/index.html"}]}